lazyrf/stm32_core/sdk/stm32f4xx_hal_conf.h
#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#include "config.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @brief This is the list of modules to be used in the HAL driver
  */
#define HAL_MODULE_ENABLED

#define HAL_CORTEX_MODULE_ENABLED

#if CONFIG_MCU_PERIPH_ADC
#define HAL_ADC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_ADC */

#if CONFIG_MCU_PERIPH_CRYP
#define HAL_CRYP_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_CRYP */

#if CONFIG_MCU_PERIPH_CAN
#define HAL_CAN_MODULE_ENABLED
#define HAL_CAN_LEGACY_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_CAN */

#if CONFIG_MCU_PERIPH_CRC
#define HAL_CRC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_CRC */

#if CONFIG_MCU_PERIPH_DAC
#define HAL_DAC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DAC */

#if CONFIG_MCU_PERIPH_DMA
#define HAL_DMA_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DMA */

#if CONFIG_MCU_PERIPH_ETH
#define HAL_ETH_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_ETH */

#if CONFIG_MCU_PERIPH_FLASH
#define HAL_FLASH_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_FLASH */

#if CONFIG_MCU_PERIPH_GPIO
#define HAL_GPIO_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_GPIO */

#if CONFIG_MCU_PERIPH_I2C
#define HAL_I2C_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_I2C */

#if CONFIG_MCU_PERIPH_I2S
#define HAL_I2S_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_I2S */

#if CONFIG_MCU_PERIPH_IRDA
#define HAL_IRDA_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_IRDA */

#if CONFIG_MCU_PERIPH_IWDG
#define HAL_IWDG_MODULE_ENABLED
#endif /* CONIFG_MCU_PERIPH_IWDG */

#if CONFIG_MCU_PERIPH_NOR
#define HAL_NOR_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_NOR */

#if  CONFIG_MCU_PERIPH_NAND
#define HAL_NAND_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_NAND */

#if CONFIG_MCU_PERIPH_PCCARD
#define HAL_PCCARD_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_PCCARD */

#if CONFIG_MCU_PERIPH_PCD
#define HAL_PCD_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_PCD */

#if CONFIG_MCU_PERIPH_HCD
#define HAL_HCD_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_HCD */

#if CONFIG_MCU_PERIPH_PWR
#define HAL_PWR_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_PWR */

#if CONFIG_MCU_PERIPH_RCC
#define HAL_RCC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_RCC */

#if CONFIG_MCU_PERIPH_RTC
#define HAL_RTC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_RTC */

#if CONFIG_MCU_PERIPH_SD
#define HAL_SD_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SD */

#if CONFIG_MCU_PERIPH_MMC
#define HAL_MMC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_MMC */

#if CONFIG_MCU_PERIPH_SDRAM
#define HAL_SDRAM_MODULE_ENABLED
#endif /* CONIFG_MCU_PERIPH_SDRAM */

#if CONFIG_MCU_PERIPH_SMARTCARD
#define HAL_SMARTCARD_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SMARTCARD */

#if CONFIG_MCU_PERIPH_SPI
#define HAL_SPI_MODULE_ENABLED
#endif /* CONIFG_MCU_PERIPH_SPI */

#if CONFIG_MCU_PERIPH_SRAM
#define HAL_SRAM_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SRAM */

#if CONFIG_MCU_PERIPH_TIM
#define HAL_TIM_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_TIM */

#if CONFIG_MCU_PERIPH_UART
#define HAL_UART_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_UART */

#if CONFIG_MCU_PERIPH_USART
#define HAL_USART_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_USART */

#if CONFIG_MCU_PERIPH_WWDG
#define HAL_WWDG_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_WWDG */

#if CONFIG_MCU_PERIPH_EXTI
#define HAL_EXTI_MODULE_ENABLED
#endif /* CONFIG_CMU_PERIPH_EXTI */

/* ============================================= */

#if CONFIG_MCU_PERIPH_DCMI
#define HAL_DCMI_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DCMI */

#if CONFIG_MCU_PERIPH_DMA2D
#define HAL_DMA2D_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DMA2D */

#if CONFIG_MCU_PERIPH_HASH
#define HAL_HASH_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_HASH */

#if CONIFG_MCU_PERIPH_LTDC
#define HAL_LTDC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_LTDC */

#if CONIFG_MCU_PERIPH_RNG
#define HAL_RNG_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_RNG */

#if CONFIG_MCU_PERIPH_SAI
#define HAL_SAI_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SAI */

#if CONIFG_MCU_PERIPH_SMBUS
#define HAL_SMBUS_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SMBUS */

#if CONFIG_MCU_PERIPH_DSI
#define HAL_DSI_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DSI */

#if CONIFG_MCU_PERIPH_QSPI
#define HAL_QSPI_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_QSPI */

#if CONIFG_MCU_PERIPH_CEC
#define HAL_CEC_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_CEC */

#if CONFIG_MCU_PERIPH_FMPI2C
#define HAL_FMPI2C_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_FMPI2C */

#if CONIFG_MCU_PERIPH_SPDIFRX
#define HAL_SPDIFRX_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_SPDIFRX */

#if CONFIG_MCU_PERIPH_DFSDM
#define HAL_DFSDM_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_DFSDM */

#if CONFIG_MCU_PERIPH_LPTIM
#define HAL_LPTIM_MODULE_ENABLED
#endif /* CONFIG_MCU_PERIPH_LPTIM */

/* ########################## HSE/HSI Values adaptation ##################### */
/**
  * @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSE is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSE_VALUE)
  #define HSE_VALUE    ((uint32_t)8000000U) /*!< Value of the External oscillator in Hz */
#endif /* HSE_VALUE */

#if !defined  (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    ((uint32_t)100U)   /*!< Time out for HSE start up, in ms */
#endif /* HSE_STARTUP_TIMEOUT */

/**
  * @brief Internal High Speed oscillator (HSI) value.
  *        This value is used by the RCC HAL module to compute the system frequency
  *        (when HSI is used as system clock source, directly or through the PLL).
  */
#if !defined  (HSI_VALUE)
  #define HSI_VALUE    ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif /* HSI_VALUE */

/**
  * @brief Internal Low Speed oscillator (LSI) value.
  */
#if !defined  (LSI_VALUE)
 #define LSI_VALUE  ((uint32_t)32000U)       /*!< LSI Typical Value in Hz*/
#endif /* LSI_VALUE */                      /*!< Value of the Internal Low Speed oscillator in Hz
                                             The real value may vary depending on the variations
                                             in voltage and temperature.*/
/**
  * @brief External Low Speed oscillator (LSE) value.
  */
#if !defined  (LSE_VALUE)
 #define LSE_VALUE  ((uint32_t)32768U)    /*!< Value of the External Low Speed oscillator in Hz */
#endif /* LSE_VALUE */

#if !defined  (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    ((uint32_t)5000U)   /*!< Time out for LSE start up, in ms */
#endif /* LSE_STARTUP_TIMEOUT */

/**
  * @brief External clock source for I2S peripheral
  *        This value is used by the I2S HAL module to compute the I2S clock source
  *        frequency, this source is inserted directly through I2S_CKIN pad.
  */
#if !defined  (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE    ((uint32_t)12288000U) /*!< Value of the External audio frequency in Hz*/
#endif /* EXTERNAL_CLOCK_VALUE */

